#**Aim:**

To handle missing data using Pandas package.

## **Algorithm:**



*   Start the program.
*   Import Pandas Package in the notebook:
      **Command**: *import pandas*.
*  Functions below are used to handle the missing data.
*   *isnull()*,*notnull()* - The function is used to identify if datasets has missing value or not. They return boolean values.
*   *dropna()* - This function removes the row having missing value(s).
*   *fillna()* - This function fills the missing value with the provided value.
*   *replace()* - This function replaces the NaN with the provided word
*   *interpolate()* - This function fills the missing data with some value(s) generated after applying the algorithm. It is better to use interpolate instead of hard coding.
*   Create Dataframe and Series and Handle the missing data using Pandas.
*   End the program.

#**Missing Data Pandas:**



*   Missing data refers to missing values in the dataset. Dataset is the collection of a huge amount of information that has been recorded over time.List item
*   This information could be related to anything like customer surveys, species of plants, animals, insects, microbes, natural calamities, internet activities, etc.List item

*   We see missing space in excel or CSV files for the missing data but when this data is read using pandas then it shows NaN in place of missing data.

![machine-learning-using-python-pandas-missing-values.png]()

**Here is an example of same datasets when read using pandas. You can observe NaN in place of empty spaces.**

![machine-learning-using-python-missing-values-in-pandas-2.png]()

There are various built-in functions to identify & handle the missing data.

**isnull(),notnull()** - The function is used to identify if datasets has missing value or not. They return boolean values.

**dropna()** - This function removes the row having missing value(s).

**fillna()** - This function fills the missing value with the provided value.

**replace()** - This function replaces the NaN with the provided word

**interpolate()** - This function fills the missing data with some value(s) generated after applying the algorithm. It is better to use interpolate instead of hard coding.

# Missing Data Pandas **DataFrame:**

Python pandas consider None values as missing values and assigns NaN in place of it.

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame({
    'Part': ['Monitor', 'CPU', None, 'Mouse', None, 'Extensions', 'Table', 'Chair', 'Wifi'],
    'Feature': ['LED', 'i7', 'RGB', 'Wireless', 'Zebronics', None, 'Urban Clap', 'Apex Chairs', 'Airtel'],
    'Price': [12000, 3500, None, 1200, None, 250, 7000, 12000, 799]
})

In [ ]:
df

         Part      Feature    Price
0     Monitor          LED  12000.0
1         CPU           i7   3500.0
2        None          RGB      NaN
3       Mouse     Wireless   1200.0
4        None    Zebronics      NaN
5  Extensions         None    250.0
6       Table   Urban Clap   7000.0
7       Chair  Apex Chairs  12000.0
8        Wifi       Airtel    799.0

In a DataFrame, we can identify missing data by using **isnull(), notnull()** functions.

**isnull()** returns True for all the missing values & False for all the occupied values.

In [ ]:
df.isnull()

    Part  Feature  Price
0  False    False  False
1  False    False  False
2   True    False   True
3  False    False  False
4   True    False   True
5  False     True  False
6  False    False  False
7  False    False  False
8  False    False  False

**notnull()** returns True for all the occupied values and False for the missing value.

In [ ]:
df.notnull()

    Part  Feature  Price
0   True     True   True
1   True     True   True
2  False     True  False
3   True     True   True
4  False     True  False
5   True    False   True
6   True     True   True
7   True     True   True
8   True     True   True

to remove all the rows having missing data we use **dropna()** function.

**dropna()** removes the entire row having missing value

In [ ]:
df.dropna()

      Part      Feature    Price
0  Monitor          LED  12000.0
1      CPU           i7   3500.0
3    Mouse     Wireless   1200.0
6    Table   Urban Clap   7000.0
7    Chair  Apex Chairs  12000.0
8     Wifi       Airtel    799.0

**replace()** function is used to replace the item(s) with name or value. It takes two popular arguments.

**to_replace:** the value you want to change

**value:** The new value you want to provide

In [ ]:
df.replace(to_replace= 12000, value=13000)

         Part      Feature    Price
0     Monitor          LED  13000.0
1         CPU           i7   3500.0
2        None          RGB      NaN
3       Mouse     Wireless   1200.0
4        None    Zebronics      NaN
5  Extensions         None    250.0
6       Table   Urban Clap   7000.0
7       Chair  Apex Chairs  13000.0
8        Wifi       Airtel    799.0

# Time Series Missing Data Pandas:

**Time series data refers to the missing data within some time classification.**

In [ ]:
import pandas as pd

In [ ]:

df = pd.DataFrame({
    'date': pd.date_range(start='2021-01-01', periods=20, freq='H'), 
    'value': range(20)
    })

In [ ]:
df

                  date  value
0  2021-01-01 00:00:00      0
1  2021-01-01 01:00:00      1
2  2021-01-01 02:00:00      2
3  2021-01-01 03:00:00      3
4  2021-01-01 04:00:00      4
5  2021-01-01 05:00:00      5
6  2021-01-01 06:00:00      6
7  2021-01-01 07:00:00      7
8  2021-01-01 08:00:00      8
9  2021-01-01 09:00:00      9
10 2021-01-01 10:00:00     10
11 2021-01-01 11:00:00     11
12 2021-01-01 12:00:00     12
13 2021-01-01 13:00:00     13
14 2021-01-01 14:00:00     14
15 2021-01-01 15:00:00     15
16 2021-01-01 16:00:00     16
17 2021-01-01 17:00:00     17
18 2021-01-01 18:00:00     18
19 2021-01-01 19:00:00     19

# Count Missing Data Pandas:

First import pandas :

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame({
    'Part': ['Monitor', 'CPU', None, 'Mouse', None, 'Extensions', 'Table', 'Chair', 'Wifi'],
    'Feature': ['LED', 'i7', 'RGB', 'Wireless', 'Zebronics', None, 'Urban Clap', 'Apex Chairs', 'Airtel'],
    'Price': [12000, 3500, None, 1200, None, 250, 7000, 12000, 799]
})

In [ ]:
df

         Part      Feature    Price
0     Monitor          LED  12000.0
1         CPU           i7   3500.0
2        None          RGB      NaN
3       Mouse     Wireless   1200.0
4        None    Zebronics      NaN
5  Extensions         None    250.0
6       Table   Urban Clap   7000.0
7       Chair  Apex Chairs  12000.0
8        Wifi       Airtel    799.0

Now we use two functions.
*   isnull()  returns true for missing values
*   sum()  returns the count

combining both these functions together gives us a total count of the missing data in a dataset.

`df.isnull().sum()`

In [ ]:
df.isnull().sum()

Part       2
Feature    1
Price      2
dtype: int64

# Remove Missing Data Pandas:

**Removing missing data is part of data cleaning.**

Missing Data can only be removed either by filling the space or by deleting the entire row that has a missing value.

**fillna()**

This function will fill all the missing values with the provided value.

In [ ]:
df.fillna('None')

         Part      Feature  Price
0     Monitor          LED  12000
1         CPU           i7   3500
2        None          RGB   None
3       Mouse     Wireless   1200
4        None    Zebronics   None
5  Extensions         None    250
6       Table   Urban Clap   7000
7       Chair  Apex Chairs  12000
8        Wifi       Airtel    799

# Interpolate Missing Data Pandas:



*   Interpolate is a powerful function that is used to fill the missing data with some values.
*   Interpolate uses a linear method to generate a value to place empty space.

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame({
    'Part': ['Monitor', 'CPU', None, 'Mouse', None, 'Extensions', 'Table', 'Chair', 'Wifi'],
    'Feature': ['LED', 'i7', 'RGB', 'Wireless', 'Zebronics', None, 'Urban Clap', 'Apex Chairs', 'Airtel'],
    'Price': [12000, 3500, None, 1200, None, 250, 7000, 12000, 799]
})

In [ ]:
df

         Part      Feature    Price
0     Monitor          LED  12000.0
1         CPU           i7   3500.0
2        None          RGB      NaN
3       Mouse     Wireless   1200.0
4        None    Zebronics      NaN
5  Extensions         None    250.0
6       Table   Urban Clap   7000.0
7       Chair  Apex Chairs  12000.0
8        Wifi       Airtel    799.0

**Filling missing values using interpolate**


*   interpolte uses linear method to generate value
*   pay attention to the values inplace of NaN

In [ ]:
df.interpolate(method='linear')

         Part      Feature    Price
0     Monitor          LED  12000.0
1         CPU           i7   3500.0
2        None          RGB   2350.0
3       Mouse     Wireless   1200.0
4        None    Zebronics    725.0
5  Extensions         None    250.0
6       Table   Urban Clap   7000.0
7       Chair  Apex Chairs  12000.0
8        Wifi       Airtel    799.0

# Impute Missing Data Pandas:

Impute missing data simply means using a model to replace missing values.

There are more than one ways that can be considered before replacing missing values. Few of them are :

- A constant value that has meaning within the domain, such as 0, distinct from all other values.

- A value from another randomly selected record.

- A mean, median, or mode value for the column.

- A value estimated by another predictive model.

Any imputing performed on the training dataset will have to be performed on new data in the future when predictions are needed from the finalized model. This needs to be taken into consideration when choosing how to impute the missing values.

For example, if you choose to impute with median column values, these median column values will need to be stored to file for later use on new data that has missing values.

Pandas provide the fillna() function for replacing missing values with a specific value.

# **Result**

The missing data is handled and program ran successfully